docs/live_captures/20260517_233332_E1_ReviewFiling_response.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><mrm:MessageReceiptMessage xmlns:ac="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:AppellateCase-4.0" xmlns:ai="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:AppInfo-4.0" xmlns:av="urn:com.journaltech:ecourt:ecf:extension:AttorneyValue" xmlns:bc="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:BankruptcyCase-4.0" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cat="urn:com.journaltech:ecourt:ecf:extension:CaseAssignmentType" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns:cc="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CitationCase-4.0" xmlns:cc1.0="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CivilCase-4.0" xmlns:cc2.0="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CriminalCase-4.0" xmlns:ccte="urn:com.journaltech:ecourt:ecf:extension:CivilCaseTypeExt" xmlns:cedte="urn:com.journaltech:ecourt:ecf:extension:CourtEventDocumentTypeExt" xmlns:cej="urn:com.journaltech:ecourt:ecf:extension:CourtEventJudgment" xmlns:cete="urn:com.journaltech:ecourt:ecf:extension:CourtEventTypeExt" xmlns:cfm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CoreFilingMessage-4.0" xmlns:cfmet="urn:com.journaltech:ecourt:ecf:extension:CoreFilingMessageExtType" xmlns:clqm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CaseListQueryMessage-4.0" xmlns:clrm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CaseListResponseMessage-4.0" xmlns:cpe="urn:com.journaltech:ecourt:ecf:extension:CaseParticipantExt" xmlns:cpqm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CourtPolicyQueryMessage-4.0" xmlns:cprm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CourtPolicyResponseMessage-4.0" xmlns:cqm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CaseQueryMessage-4.0" xmlns:cqmte="urn:com.journaltech:ecourt:ecf:extension:CaseQueryMessageTypeExt" xmlns:crm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CaseResponseMessage-4.0" xmlns:ct="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:CommonTypes-4.0" xmlns:cv="urn:com.journaltech:ecourt:ecf:extension:ContactValue" xmlns:cv1.0="urn:com.journaltech:ecourt:ecf:extension:CodeValue" xmlns:dc="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:DomesticCase-4.0" xmlns:dfmd="urn:com.journaltech:ecourt:ecf:extension:DocumentFilingMetaData" xmlns:dfs="urn:com.journaltech:ecourt:ecf:extension:DocumentFilingStatus" xmlns:dqm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:DocumentQueryMessage-4.0" xmlns:drm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:DocumentResponseMessage-4.0" xmlns:drmte="urn:com.journaltech:ecourt:ecf:extension:DocumentResponseMessageTypeExt" xmlns:dv="urn:com.journaltech:ecourt:ecf:extension:DocumentValue" xmlns:fcqm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FeesCalculationQueryMessage-4.0" xmlns:fcqmte="urn:com.journaltech:ecourt:ecf:extension:FeesCalculationQueryMessageTypeExt" xmlns:fcrm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FeesCalculationResponseMessage-4.0" xmlns:fcrmte="urn:com.journaltech:ecourt:ecf:extension:FeesCalculationResponseMessageTypeExt" xmlns:fcte="urn:com.journaltech:ecourt:ecf:extension:FeesCalculationTypeExt" xmlns:fit="urn:com.journaltech:ecourt:ecf:extension:FilingIdentityType" xmlns:flqm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FilingListQueryMessage-4.0" xmlns:flqmte="urn:com.journaltech:ecourt:ecf:extension:FilingListQueryMessageTypeExt" xmlns:flrm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FilingListResponseMessage-4.0" xmlns:flrmte="urn:com.journaltech:ecourt:ecf:extension:FilingListResponseMessageTypeExt" xmlns:fsqm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FilingStatusQueryMessage-4.0" xmlns:fsr="urn:com.journaltech:ecourt:ecf:extension:FilingStatusReason" xmlns:fsrm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:FilingStatusResponseMessage-4.0" xmlns:ing="http://niem.gov/niem/domains/screening/2.0" xmlns:ist="http://niem.gov/niem/ansi-nist/2.0" xmlns:jc="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:JuvenileCase-4.0" xmlns:mrm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:MessageReceiptMessage-4.0" xmlns:nanptne="urn:com.journaltech:ecourt:ecf:extension:NANPTelephoneNumberExt" xmlns:nfo1.0="http://niem.gov/niem/appinfo/2.0" xmlns:nfrcrt="urn:com.journaltech:ecourt:ecf:extension:NFRCResponseType" xmlns:nfrcrt1.0="urn:com.journaltech:ecourt:ecf:extension:NFRCRequestType" xmlns:ns54="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:PaymentReceiptMessage-4.0" xmlns:ode="http://docs.oasis-open.org/codelist/ns/genericode/1.0/" xmlns:ore="http://niem.gov/niem/niem-core/2.0" xmlns:pm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:PaymentMessage-4.0" xmlns:pme="urn:com.journaltech:ecourt:ecf:extension:PaymentMessageExt" xmlns:rct="urn:com.journaltech:ecourt:ecf:extension:RelatedCaseType" xmlns:rdcm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:RecordDocketingCallbackMessage-4.0" xmlns:rdm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:RecordDocketingMessage-4.0" xmlns:rdmte="urn:com.journaltech:ecourt:ecf:extension:RecordDocketingMessageTypeExt" xmlns:rdt="urn:com.journaltech:ecourt:ecf:extension:ReviewedDocumentType" xmlns:res="http://niem.gov/niem/structures/2.0" xmlns:rfcm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:ReviewFilingCallbackMessage-4.0" xmlns:rsqm="urn:com.journaltech:ecourt:ecf:extension:RecordingStatusQueryMessage" xmlns:rsrm="urn:com.journaltech:ecourt:ecf:extension:RecordingStatusResponseMessage" xmlns:sae="urn:com.journaltech:ecourt:ecf:extension:StructuredAddressExt" xmlns:sig="http://www.w3.org/2000/09/xmldsig#" xmlns:siqm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:ServiceInformationQueryMessage-4.0" xmlns:siqmte="urn:com.journaltech:ecourt:ecf:extension:ServiceInformationQueryMessageTypeExt" xmlns:sirm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:ServiceInformationResponseMessage-4.0" xmlns:sirmte="urn:com.journaltech:ecourt:ecf:extension:ServiceInformationResponseMessageTypeExt" xmlns:srm="urn:oasis:names:tc:legalxml-courtfiling:schema:xsd:ServiceReceiptMessage-4.0" xmlns:tne="urn:com.journaltech:ecourt:ecf:extension:TelephoneNumberExt" xmlns:wspd="urn:oasis:names:tc:legalxml-courtfiling:wsdl:WebServicesProfile-Definitions-4.0" xmlns:xdm="http://niem.gov/niem/domains/jxdm/4.0" xmlns:zcv="urn:com.journaltech:ecourt:ecf:extension:ZipCodeValue"><ore:DocumentFileControlID>26MA00004663</ore:DocumentFileControlID><ore:DocumentIdentification><ore:IdentificationID>26MA00004663</ore:IdentificationID><ore:IdentificationCategoryText>FILING_ASSEMBLY_MDE</ore:IdentificationCategoryText></ore:DocumentIdentification><ore:DocumentReceivedDate><ore:DateRepresentation xmlns:xsd="http://niem.gov/niem/proxy/xsd/2.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:dateTime">2026-05-17T16:33:32.047-07:00</ore:DateRepresentation></ore:DocumentReceivedDate><xdm:CaseCourt xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ct:Error><ct:ErrorCode>0</ct:ErrorCode><ct:ErrorText>No Error</ct:ErrorText></ct:Error></mrm:MessageReceiptMessage></soap:Body></soap:Envelope>